[
  {
    "name": "Aviv Shalgi",
    "linkedin": "https://www.linkedin.com/in/avivshalgi/",
    "bio": "3-exit serial entrepreneur using data analytics and machine learning to solve interesting problems in various industries. Business Development and Corporate Development professional with several successful M&A, Venture investments and joint ventures under my belt (from conceptualization, sourcing, modeling, diligence, to closing and merger). A Board Member, Mentor and Advisor to many entrepreneurs, startups, investors, venture funds and non-profit organizations. Accredited as Angel Investor.",
    "capital_raised": "3,000,000",
    "exits": "3",
    "value_of_exits": "1,000,000,000+",
    "expertise": "Machine Learning, M&A, AR",
    "company": "Independent Consultant"
  },
  {
    "name": "Andy Patrick",
    "linkedin": "https://www.linkedin.com/in/andypatrick1/",
    "bio": "Andy Patrick, Co-Founder, brings leadership at the intersection of technology, design, and strategic innovation. From co-founding Adjacency, which created e-commerce platforms for iconic brands like Apple and Patagonia, to leading acquisitions and SaaS innovation at Roam Media and liveBooks, Andy’s expertise is rooted in scaling ideas into impactful realities. Known for his visionary leadership, he is a consummate connector, blending emotional intelligence with an ability to identify and execute market-defining strategies. His passion for social impact led him to create the Mad Housers, an organization dedicated to building small, one-person huts to provide emergency shelter for homeless individuals. Andy has also brought his strategic and technological insights to the boards of renowned organizations such as Mother Jones magazine, the Kinsey Institute, and Richard Gere’s Foundation, Healing the Divide. Andy’s unique ability to bridge innovation, social impact, and strategic execution is a cornerstone of his vision for a more sustainable future.",
    "capital_raised": "15,000,000+",
    "exits": "3",
    "value_of_exits": "60,000,000+",
    "expertise": "AI, SaaS, E-commerce, Design, IP",
    "company": "Independent Consultant"
  },
  {
    "name": "Agnes Brichard",
    "linkedin": "https://www.linkedin.com/in/agnes-brichard-16ba414/",
    "bio": "Agnes Brichard holds an MBA from Harvard Business School, an Engineering degree from University of Louvain in Belgium and a Master’s from University of Cologne in Germany. She is a senior global executive in the CPG industry, where she built and ran organizations of $500MM revenues and 1,000+ people in China, Latin America, Russia, Canada, UK and several European countries. She has held country CEmuditO and CMO roles, as well as commercial positions, for P&G, Reckitt, Danone, L’Oréal and The Walt Disney Company. At ease in any culture, she speaks 5 languages and lived in 12 countries. Entrepreneur at heart, she was in the founding team of a VC-backed eCommerce venture, which was successfully sold to a leading European grocer. Prior to that she was a consultant with McKinsey. She is now Entrepreneur-in-Residence with Harvard Alumni Entrepreneurs, where she advises consumer tech startups. Her passion is to help startups expand internationally and forge strategic alliances with large corporations. Her expertise includes disruptive strategies for accelerating growth, fundraising, scaling, go-to-market and marketing.",
    "capital_raised": "50,000,000",
    "exits": "1",
    "value_of_exits": "",
    "expertise": "AI, Marketing, Engineering, Fundraising, AR",
    "company": "Independent Consultant"
  },
  {
    "name": "Amy Peck",
    "linkedin": "https://www.linkedin.com/in/amypeckxr/",
    "bio": "Amy Peck is the Founder & CEO of EndeavorXR, a leading global XR strategy & consulting firm. She is one of the world’s foremost strategists on immersive technology including Digital Twins, Web 3.0 and applied AI. She advises Fortune 500 companies, government agencies and advanced technology startups on how to leverage emerging technology to optimize all aspects of business. She is a globally recognized futurist, and gives lectures, workshops and keynotes on emerging technology, business and innovation with XR, AI and Blockchain. Amy was recently named one of the Top 50 Most Powerful Women in Tech and Top 100 Women of The Future. She serves as an Executive Advisor to Booz Allen Hamilton within their CTO Applied R&D center, Bright Labs. She also serves as Lead Advisor, AI & New Media, for the Royal Commission of Riyadh City and The Royal Court. Amy is an angel investor and Venture Partner at the Capital Region XR Accelerator. Amy sits on the Board of Advisors for multiple companies and is Executive Board Chair of Prospera Women, a global organization supporting female-led startups. She works with universities and government agencies advising on the development of innovation hubs, accelerators and emerging technology programs. Her own personal mission is to see technology accessible to all fundamentally improving every aspect of our lives and elevating the way we work, learn, communicate and play.",
    "capital_raised": "5,000,000",
    "exits": "",
    "value_of_exits": "",
    "expertise": "AI, Blockchain, Strategy, IP, XR",
    "company": "EndeavorXR"
  },
  {
    "name": "Andy Colman",
    "linkedin": "https://www.linkedin.com/in/andrewhcolman/",
    "bio": "Andy Colman is a start-up executive with four CEO and Co-founder roles spanning 15 years in energy, renewables, sustainability, utilities and smart buildings. His specialties are SaaS, machine learning and IoT platforms, including hardware. His start-ups have seen rapid sales growth, significant funding and successful acquisitions, with equity transactions totaling $250 million. He has served on a dozen boards of directors and advisors. In addition to his entrepreneurship, Andy has 15 years of experience at major corporations including Black & Veatch, Booz Allen & Hamilton and Westinghouse, where he was on design teams for advanced fission and fusion reactors.",
    "capital_raised": "100,000,000",
    "exits": "1 IPO; 3 Acquisitions",
    "value_of_exits": "",
    "expertise": "AI, Machine Learning, SaaS, IoT, Sales",
    "company": "Independent Consultant"
  },
  {
    "name": "Andrew Filler",
    "linkedin": "https://www.linkedin.com/in/andrew-filler-83b7854/",
    "bio": "Andrew Filler is a Partner and General Counsel of Sherpa Technology Group, an IP consultancy for major brands, and has served as Vice President of Intellectual Property for Nanosys for twenty years, a leader in nanotechnology materials for the display industry. He also consults with a number of technology companies in Silicon Valley, Canada, Europe and Japan on a variety of legal, business, and intellectual property matters. He has more than 25 years of intellectual property management, legal and business experience and expertise. Andrew Filler graduated with distinction with a Bachelor of Science in mechanical engineering from Cornell University, holds a J.D. magna cum laude from the University of San Francisco Law School and was named one of the top corporate IP attorneys in Silicon Valley by the Silicon Valley Business Journal.",
    "capital_raised": "",
    "exits": "3",
    "value_of_exits": "1,000,000,000+",
    "expertise": "Engineering, IP, Legal, AR",
    "company": "Independent Consultant"
  },
  {
    "name": "Arjen Maarleveld",
    "linkedin": "https://www.linkedin.com/in/arjenm/",
    "bio": "After starting his career at Oracle and Apple while based in Silicon Valley and China, Arjen has held C-level positions in New Zealand, France, and Belgium, primarily in tech and telecoms companies ranging from startups to EUR 45 Billion public companies. Most recently, he was co-founder of Aucto, a B2B marketplace. He and his Canadian co-founder raised a USD 3 million seed round led by venture capital firm NfX. Arjen now leads DynaVersal, a business consulting practice where he works with management teams from a wide range of industries, focusing on US market entry for overseas companies; global strategies and plans for US-based firms; and capital raising and M&A strategies and execution. Arjen is also a CEO coach and mentor. As Vistage Chair, he facilitates a peer group of Silicon Valley CEOs from diverse industry sectors.",
    "capital_raised": "4,000,000",
    "exits": "10",
    "value_of_exits": "",
    "expertise": "AI, M&A, AR",
    "company": "DynaVersal"
  },
  {
    "name": "Ben Connors",
    "linkedin": "https://www.linkedin.com/in/benconnors/",
    "bio": "Technology companies are always looking for ways to generate more revenue and profitable growth, while using fewer resources. I create profitable revenue growth and a healthy business ecosystem to exceed business goals efficiently. This derives from my strategizing new market opportunities, identifying and prioritizing go-to-market (including appropriate partners) to pursue these opportunities, creating dynamic business plans, then executing/managing for success. I create this value by synergizing multiple diverse perspectives from inside the company as well as the entire business ecosystem. This methodology leverages my background in integrating creative strategy with tactical execution, business with technical considerations, multiple cross-functional objectives and constraints, and short-term with long-term goal achievement for mutual partner success. In addition to direct sales, I have created partnerships to generate millions of dollars in incremental revenue, spanning OEM, System Integrator, Reseller, and complementary product/service providers, from large companies to emerging technology providers.",
    "capital_raised": "80,000,000",
    "exits": "1 IPO; 1 Acquisition",
    "value_of_exits": "",
    "expertise": "AI, Sales, Product, Strategy, IP",
    "company": "Independent Consultant"
  },
  {
    "name": "Bow Rodgers",
    "linkedin": "https://www.linkedin.com/in/bow-rodgers-561425/",
    "bio": "Bow is an accomplished C-level executive and serial entrepreneur who knows how to fund and rapidly scale early stage companies. This skill has been learned through his breadth of management experience ranging from Group President of Sprint Telecommunications (with a two-billion-dollar P&L) managing the Western United States, to getting funded by Microsoft for startup, Human Engineered Software. He has held CEO and COO positions with successful early-stage and enterprise corporations. In addition, he has seen over 15,000 funding pitches and mentored over 100 companies. Bow has successfully negotiated funding rounds with first-tier venture capital firms for two startup companies. His specialties include but are not limited to creating a solid \"Value Proposition\" for each company that is the foundation for their business development and rapid scaling. He believes a clear and compelling Value Proposition is the key foundation to improve both funding and design win strategies. In addition, as founder and CEO of Vet-Tech, Inc., Bow successfully mentored U.S. Veteran entrepreneurs to build and fund their business through the Vet-Tech network.",
    "capital_raised": "25,000,000",
    "exits": "4",
    "value_of_exits": "",
    "expertise": "Design, Software, AR",
    "company": "Independent Consultant"
  },
  {
    "name": "Carl Hinrichsen",
    "linkedin": "https://www.linkedin.com/in/carlhinrichsen/",
    "bio": "Carl is a senior executive and intrapreneur with over 15 years of international experience on a mission to build scale through ecosystems. He most recently expanded Meta's international presence by 40 additional countries, building and leading the channel sales business. He has also held sales management, partnership strategy and customer success roles at Meta. Prior to that, as a Product team leader at Amazon, he launched the Kindle Accessories Marketplace. At Bertelsmann, Carl built Germany's first entertainment + telco partnerships. He has a track record building and scaling teams and businesses that span across geographies and time zones and is equally at home in early stage as well as highly scaled environments. Carl holds an MBA from NYU Stern and ESADE business school. Carl and his family live in San Francisco.",
    "capital_raised": "",
    "exits": "",
    "value_of_exits": "",
    "expertise": "AI, Sales, Product, Strategy, IP",
    "company": "Independent Consultant"
  },
  {
    "name": "Crystelle Desnoyer",
    "linkedin": "https://www.linkedin.com/in/bow-rodgers-561425/",
    "bio": "Crystelle Desnoyer is a Principal at Adobe focused on their Strategic Partnerships for their GenAI products. She is the former Chief of Staff to the CEO at Techstars and at Kyndryl (Public company spin-off of IBM) to their consulting business. With experience scaling 27 tech firms and in ecommerce, management consulting, and venture capital firms, she brings a multi-layered perspective to teams needing rapid execution and rapid growth. She serves on the Board of La French Tech New York and is active in networks supporting women executives, investors and founders. Passionate about giving back, Crystelle advises early-stage founders and curates programming for global conferences. She also values community and runs the Chief of Staff group (Fortune 1000) within CHIEF as well as an NYC tech community builder group. Having lived in 10 countries, crossed the Atlantic on a sail boat during the pandemic, she is also a certified rescue scuba diver, tango dancer, and speaks five languages.",
    "capital_raised": "2,500,000 (startup); $80,000,000 on fund side (JPM as partner)",
    "exits": "4",
    "value_of_exits": "",
    "expertise": "AI, Product, IP, AR",
    "company": "Independent Consultant"
  },
  {
    "name": "Daniel Maco",
    "linkedin": "https://www.linkedin.com/in/dannymaco/",
    "bio": "Danny Maco has been part of the USMAC community for over 15 years. Danny is an engineering, technology, operations and product executive with experience leading a spectrum of organizations from US and international startups through multi billion-dollar enterprises. Danny’s career has spanned a wide range of industries including semiconductor, IT services, AR/VR, adtech, mobile/SW development, manufacturing/ERP, eComm, insurance and gaming.For the past decade, Danny has been focused on leading product technologies surrounding connected vehicles and data driven auto/home/commercial insurance products. In the past 3 years, he has transferred this expertise towards the world of Aviation and AAM (Advanced Air Mobility) through his work with AeroTelematics. Additionally, Danny has mentored and advised founders, startups and scale ups in LegalTech, AI product ops, AI insurtech/broker tech, material sciences, fintech, and D2C models where engagement analytics, gamification and the consumer experience are paramount. Danny is an active member of VFS (Vertical Flight Society) and the Insurtech Association, as well as serving on multiple committees for the AIA (Aviation Insurance association). He was also a founding board member of BAIA (Business Association Italy America).",
    "capital_raised": "40,000,000",
    "exits": "3",
    "value_of_exits": "",
    "expertise": "AI, Product, Engineering, IP, Legal",
    "company": "Independent Consultant"
  },
  {
    "name": "Don Lindsay",
    "linkedin": "https://www.linkedin.com/in/dlindsay/",
    "bio": "Don works as a Board Director at Linearity GmbH. Don is an executive leader in a career that has spanned over three decades with Fortune 100 tech leaders. He has delivered industry-defining desktop & mobile platforms and products while building and leading corporate scale, world-class product design organizations. Don is a recognized expert, innovator and contributor in product experience with over 190 granted or filed utility patents encompassing user interface design, gesture & speech interaction and UI implementation strategies for both desktop & mobile platforms. Today, Don advises startups and large companies looking to achieve truly world class products and customer experiences through successfully developed and integrated organizations, processes, product strategies & roadmaps.",
    "capital_raised": "",
    "exits": "1",
    "value_of_exits": "600,000,000",
    "expertise": "Product, Design, Mobile, AR",
    "company": "Linearity GmbH"
  },
  {
    "name": "Eileen Goodwin",
    "linkedin": "https://www.linkedin.com/in/eileen-goodwin/",
    "bio": "Ms. Goodwin has over thirty years of leadership experience in building consensus and in completing complex projects involving numerous parties on time and within budget. As Executive Director of the Santa Clara County Traffic Authority, Ms. Goodwin successfully delivered the $1.6 billion Measure A Highway Improvement Program including building 18 miles of new Highway 85 and widening Highways 101 and 237. Since completing the mission of the Traffic Authority, Ms. Goodwin has been President of Apex Strategies, counseling and assisting public agencies and private parties in favorably positioning their projects and programs with the community and the media. Strategic Plans, Expenditure Plans, program management for sales tax programs are specific areas of expertise. Community outreach for county-wide services, transportation and water projects, and land use issues are her specialty. Ms. Goodwin is recognized state-wide and nationally as an expert and innovator in the field of community participation, strategic planning and sales tax programs. Her thirty years of professional experience include political campaign management, marketing, and organization and government management.",
    "capital_raised": "1,000,000,000+ (for government projects)",
    "exits": "1",
    "value_of_exits": "",
    "expertise": "AI, Marketing, Sales, IP, AR",
    "company": "Apex Strategies"
  },
  {
    "name": "Farzad Ehsani",
    "linkedin": "https://www.linkedin.com/in/farzadehsani/",
    "bio": "Farzad built and managed data science and product development teams for >15 years, and mentored them to create some of the most innovative technologies in their industries. He led the development of technologies that a Fortune 100 company acquired for $90 million, led the development of the industry’s first multi-modal AI, ASR, & NLP wellness app for >500K foods, which processes spoken language and estimates nutritional information with high accuracy. Farzad also managed the creation of pioneering speech translation technologies which the U.S. Army and several hospitals used to communicate with non-English speakers. He built his own product development consulting business, which enabled clients in several industries (including machine learning and healthcare) to grow, and he successfully evangelized products at industry-wide conferences (including South by Southwest). Won >15 U.S. patents for technologies, including machine learning, natural language processing, IoT, big data, predictive analytics, & deep learning algorithms and leveraged extensive travel in North America, Europe, Japan, China, India, Southeast Asia, and North Africa to understand different cultures and markets.",
    "capital_raised": "10,500,000",
    "exits": "3",
    "value_of_exits": "",
    "expertise": "AI, Machine Learning, Data Science, IoT, Product",
    "company": "Independent Consultant"
  },
  {
    "name": "Gail Gannon",
    "linkedin": "https://www.linkedin.com/in/gailgannon/",
    "bio": "If innovation had a passport, Gail Christine’s would be full. As the founder and CEO of Ensanté, she’s spent over 20 years helping health tech and biotech entrepreneurs get their ideas out of the lab and into the world—without losing their sanity (or their sense of humor). Gail’s journey has taken her from investment banking to angel investing, from advising at the PATHGates Foundation ($65M portfolio) to mentoring startups at Stanford, UCSF, and UC Berkeley. She’s guided founders through the highs and lows of building companies, facilitated three successful exits, and learned that sometimes the best business plans are written on napkins. She’s led international bootcamps, helped startups secure funding and first customers, and worked with organizations like USAID, the UN, and the World Bank to bring responsible technology to new markets. Along the way, she’s become a familiar face at global forums—BIO International, Health 2.0/HIMSS, SXSW—where she’s as likely to be found judging a pitch competition as sharing a coffee with the next big thing in healthcare. Gail’s academic roots run deep, with a master’s from Harvard T.H. Chan School of Public Health (Patricia Roberts Harris Fellow), a Biotech Honors Certificate from UC Santa Cruz, honors thesis “Medicalization of Aging”, UC Berkeley. She’s happiest when she’s helping others succeed, whether that’s a founder with a wild idea or a Fortune 500 team looking for their next breakthrough.",
    "capital_raised": "10,000,000+",
    "exits": "1",
    "value_of_exits": "",
    "expertise": "AI, IoT, Healthcare, AR",
    "company": "Independent Consultant"
  },
  {
    "name": "Gideon Marks",
    "linkedin": "https://www.linkedin.com/in/gideonmarks/",
    "bio": "Seasoned tech executive with deep expertise in finance, business strategy, and corporate development. Took 3 companies public on NASDAQ and led 4 others through successful M&A transactions. Hands-on experience building and scaling companies, driving growth initiatives, and raising capital from VCs and public markets. Active angel investor in standout startups including DoorDash, Tipalti, Sixense, MeMed, DeepDub, Alteon Websystems, Ruckus Wireless, AppLovin, PictureVision, HeartVista, and Rescale. Co-founder of DogLog™ (https://doglogapp.com), the all-in-one app transforming pet wellness and care. Dedicated mentor and coach to founders, students, and companies through programs such as Google for Startups, US Market Access Center, Mind the Bridge, European Innovation Academy, Plug and Play, and more—empowering the next generation of global entrepreneurs. Specialties: Strategic planning, M&A, IPOs, CFO leadership, angel investing, startup mentoring, corporate growth, team building, and pet wellness innovation.",
    "capital_raised": "100,000,000",
    "exits": "7 (3 IPO; 4 M&A)",
    "value_of_exits": "",
    "expertise": "AI, Strategy, M&A, IP, Finance",
    "company": "Independent Consultant"
  },
  {
    "name": "Jonathon Angell",
    "linkedin": "https://www.linkedin.com/in/jonathonangell1/",
    "bio": "I am a strategic CFO who partners with founders to unlock the full potential of their businesses, specializing in fundraising, M&A, and founder exits that create generational wealth. Unlike traditional CFOs, I bring a unique combination of financial expertise, deal-making creativity, and an entrepreneurial mindset, ensuring every step—from securing capital to negotiating exits—is tailored to maximize value and achieve transformative outcomes for founders. Accredited as Angel Investor. My expertise spans the full lifecycle of transactions in the middle market, from origination to close, including: • CFO Services: Comprehensive financial leadership, including accounting, financial planning and analysis (FP&A), internal controls, cash flow management, budgeting, strategic planning, and performance monitoring. • Capital Acquisition: Securing growth capital through strategic recapitalization (debt and equity financing). • M&A: Delivering liquidity solutions for exiting owners while maximizing company value. • Founder Exits: Financial analysis, valuations, deal structuring, and negotiation.",
    "capital_raised": "200,000,000",
    "exits": "6",
    "value_of_exits": "",
    "expertise": "AI, Fundraising, M&A, IP, AR",
    "company": "Independent Consultant"
  },
  {
    "name": "Jay Onda",
    "linkedin": "https://www.linkedin.com/in/jay-onda/",
    "bio": "Jay has been building his career on the forefront of innovation, technology, and design, to make visions of the future a reality. As a Director at Marubeni Ventures, Jay is supporting the growth and scale of their corporate venturing activities. He is focusing on a wide range of thematics from Web3, Data/AI, to Sustainability; sourcing companies from Seed to Series B on the Horizon 3time scale. Marubeni is one of the world's largest trading companies in Japan with a global network. Their business groups include Consumer Products (Lifestyle, Food, Ag); Materials (wood, chemicals, metals, and minerals); Energy & Infrastructure; Transportation and Machinery. Jay Onda was formally with Orange Silicon Valley focusing on their Startup Investment activities focusing on various strategic areas including AI, Machine Learning, Connectivity, 5G, Logistics and Smart Cities, B2B Enterprise, and Impact related themes. Jay was a founding member of Yamaha Motor Ventures & Laboratory Silicon Valley (YMVSV) where he serves as Venture Partner and Director of Strategic Investments in Menlo Park, California. Jay has also worked with various corporations to identify key up and coming trends, build strategy, and has executed award winning PoC’s and NRE’s by collaborating with startup companies around the world. He is also an active supporter of Start Up Accelerators and participates as a mentor and advisor. Through his activity as a Corporate Venture Capitalist, he has deeply engaged in the start up community, many which have been acquired or are on the path of IPO. Early in his career, he worked as a Designer, UI/UX Engineer, and Product Manager. His focus on usability and user centric design has contributed to the growth and success of companies he has worked for.",
    "capital_raised": "",
    "exits": "",
    "value_of_exits": "",
    "expertise": "AI, Machine Learning, Product, Design, Strategy",
    "company": "Marubeni Ventures"
  },
  {
    "name": "James Daley",
    "linkedin": "https://www.linkedin.com/in/1jdaley/",
    "bio": "James has always worked at the intersection of ideas and monetization. He co-founded the banking software company which sells the WizTM SaaS product line (now a division of Wolters Kluwer, NV http:/WKL-AS). Prior, he cofounded a community-bank advisory firm that did private equity financing and operational consulting. Earlier, he worked in venture capital, derivative swaps for Goldman, Sachs & Co. and on project financings for Morgan Stanley Dean Witter. His talent is in creative, strategic marketing and execution (organizational efficiency). He has a BS in Systems Engineering and a Wharton BS from the Management & Technology Program at Univ. of Pennsylvania. He also has a Harvard MBA.",
    "capital_raised": "187,000,000 (Belvedere: $160M, PCi/Medici: $8M, Mercantile Bank $20M)",
    "exits": "2",
    "value_of_exits": "PCi: $5MM raised sold for $85MM in 6yrs, California Community Financial Institutions",
    "expertise": "SaaS, Marketing, Product, Engineering, Software",
    "company": "Independent Consultant"
  },
  {
    "name": "Marc Frangos",
    "linkedin": "https://www.linkedin.com/in/jmfrangos/",
    "bio": "Jean-Marc is a global executive specialized in innovation transformation for large corporations. He focuses on digital innovation processes and ensures they are open and optimized. His experiences lie in identifying disruptive technologies and new business models, driving their adoption in the organization, and advising entrepreneurs and startups to maximize impact. My private consultancy practice is based on 20+ years of experience as a global innovation executive at BT (British Telecom). I managed global innovation processes, labs and incubators, and consistently generated revenue or cost transformation, with teams spanning 3 continents and recognized impact at CEO level. Examples of recent engagements: • • • • • • • • • • •",
    "capital_raised": "",
    "exits": "",
    "value_of_exits": "",
    "expertise": "AR",
    "company": "Independent Consultant"
  },
  {
    "name": "Kenan Rappuchi",
    "linkedin": "https://www.linkedin.com/in/kenan-rappuchi/",
    "bio": "Kenan Rappuchi is the Founder and Chief Growth Officer of Sellerant, an Austin-based B2B growth services company. Working closely with founders, accelerators and investors since 1995, his expertise covers go-to-market strategy, growth marketing, sales prospecting, lead generation, sales enablement and revenue operations to help startups launch and scale faster with the least cost and risk. Accomplishments: - MassChallenge Texas Top Expert 2018 - Top performing HubSpot for Startups solutions partner every year since 2020 - Delivered over 50 go-to-market, brand strategy & sales acceleration workshops - Advisory board member, growth services partner, sales coach and mentor in over 30 exits - Alchemist and MassChallenge sales coach, mentor and fractional CRO for over 100 startups",
    "capital_raised": "",
    "exits": "1 as founder; 30+ as advisor",
    "value_of_exits": "25,000,000 to >$250,000,000",
    "expertise": "Marketing, Sales, Strategy, Operations, AR",
    "company": "Independent Consultant"
  },
  {
    "name": "Ken Singer",
    "linkedin": "https://www.linkedin.com/in/kensinger/",
    "bio": "Ken Singer is a serial entrepreneur, technology executive, university lecturer and investor/advisor to numerous startups. He has been the Managing Director of the Sutardja Center for Entrepreneurship and Technology at the University of California, Berkeley since 2012 and Chief Learning Officer of the Center since 2019. Ken is the co-creator of the Berkeley Method of Entrepreneurship pedagogy and is the inventor of the game-based Challenge Lab course now taught in several universities around the world. Challenge Lab courses engage local industry leaders and corporations in spinning out student-led startups such as Eko (a medical device for underserved markets). Ken is a frequent speaker at industry conferences and has been a guest lecturer at universities in Europe, Middle East, Latin America, and Asia. He works with governments and universities to foster entrepreneurship education and consults with corporations on product and innovation management. Ken is the Academic Chair of the European Innovation Academy and also the co-founder of the Applied Innovation Institute, a nonprofit that sponsors student competitions and innovation projects around the world.",
    "capital_raised": "7,000,000",
    "exits": "2",
    "value_of_exits": "40,000,000",
    "expertise": "AI, Product, IP, AR",
    "company": "Independent Consultant"
  },
  {
    "name": "Jeff Hansen",
    "linkedin": "https://www.linkedin.com/in/tbirdjeff/",
    "bio": "My focus on building a business in AI tech in sports and fitness brings two passions together in one. As a mentor and investor, I also want to help companies that have clearly solved problems for a consumer or business. As a Venture Partner or as an advisor to Venture firms or Family Offices, I focus on mentoring and advising early-stage, growth companies. The panacea of \"fit\" is Venture-funded startups with global reach in sports tech! I led global sales for AI-based robotics at Sarcos, producing commercial Exoskeletons and outdoor and Sub Sea robots. I also led Global Sales for Magic Leap and Unity, and Global Marketing for Microsoft, three of the leaders in Spatial Computing/AR and real-time 3D (with Meta and Apple Vision Pro now giving everyone new hope). There were challenges and plenty of learning experiences in both that I can leverage to help other companies. I have been an investor and entrepreneur and consultant to entrepreneurs, so I know how hard business can actually be in the start-up phase. I have been a Board member for several CPG companies, and have held roles in international sales, channel and product marketing, business development, e-commerce, and global supply chain.",
    "capital_raised": "100,000,000 (across several companies, directly and as part of management",
    "exits": "4",
    "value_of_exits": "500,000,000",
    "expertise": "AI, E-commerce, Marketing, Sales, Product",
    "company": "Independent Consultant"
  },
  {
    "name": "Leah Edwards",
    "linkedin": "https://www.linkedin.com/in/leahedwards/",
    "bio": "Leah’s expertise is in developing new solutions to big, meaningful problems. After being a serial co-founder of Enterprise Software, Marketing Automation and Sustainability companies, she is now focusing on coaching founders and executives, advising individuals, corporates, family offices and VC's interested in startups, and teaching entrepreneurship and technology innovation in top universities. Leah is accredited as an Angel Investor and has an MBA from Stanford University. After being a serial co-founder of Enterprise Software, Marketing Automation and Sustainability companies, I am now: + funding growing companies + coaching founders and executives + advising individuals, corporates, family offices and VC's interested in startups + and teaching entrepreneurship and technology innovation in top universities.",
    "capital_raised": "",
    "exits": "1",
    "value_of_exits": "380,000,000",
    "expertise": "AI, Marketing, IP, Software, AR",
    "company": "Independent Consultant"
  },
  {
    "name": "Ann Conner",
    "linkedin": "https://www.linkedin.com/in/louannconner/",
    "bio": "Accredited as an Angel Investor, LouAnn is a strategic global operations executive, board member, and advisor who delivers impacting value through integration, business operations, strategy, and thought leadership. She drives expansion by aligning strategy, people, and operations and partner successfully within companies to deliver strong performing teams, translate strategy into executable projects, improve performance, and define policies and procedures. Her notable achievements include: GLOBAL MANAGEMENT: Led large global technical programs with geographically dispersed teams with values of up to $100M for aerospace and telecommunications programs. LARGE EXECUTION: Led construction of Teleglobe’s European backbone covering over 12 countries and completing under budget and schedule. TURNAROUND: Reengineered IT PMO operations, improving project quality and delivery for PricewaterhouseCoopers, reducing project overages in time and budget by 44% and cutting time from six months to two weeks. MARQUEE DELIVERY: Drove implementation of eBay’s updated HR Information System (HRIS) touching all 20,000 employees around the globe. CHANGE MANAGEMENT: Set standard for change management, implementing response to mindset and process changes in response to enterprise risk and HRIS system updates touching over 33,000 employees and contractors.",
    "capital_raised": "1,200,000",
    "exits": "",
    "value_of_exits": "",
    "expertise": "Strategy, IP, Operations, AR",
    "company": "Independent Consultant"
  },
  {
    "name": "Victor Hsia",
    "linkedin": "https://www.linkedin.com/in/victor-hsia-4211a1/",
    "bio": "Victor Hsia is a seasoned business development and sales leader in the high-tech and display-technology sector, recognized for his expertise in licensing, commercialization, and strategic partnerships for next-generation materials and emerging applications. As Vice President of Sales & Business Development at NS Nanotech, Inc. in Sunnyvale, California, Victor leads the global go-to-market strategy for Group III-Nitride (InGaN) nanowire LED technologies, with a focus on micro-displays and AR/VR/XR applications. He has played a pivotal role in securing licensing deals for red and green nanowire LEDs and in launching the world’s first solid-state far-UVC emitter. Beyond his corporate role, Victor serves as a Business Development Advisor for Cellid Co., Ltd., a Japanese AR optics startup, and as Chair of Corporate Communications for the Bay Area chapter of the Society for Information Display (BA-SID). A UC Davis graduate in Electrical and Computer Engineering, Victor combines deep technical expertise with business leadership to drive innovation, growth, and market adoption across the display and photonics industries. Accredited as Angel Investor.",
    "capital_raised": "100,000,000+",
    "exits": "2",
    "value_of_exits": "2xIPO; $15,000,000",
    "expertise": "AI, Sales, Engineering, Strategy, IP",
    "company": "Sales & Business Development at NS Nanotech"
  },
  {
    "name": "Tim Wagner",
    "linkedin": "https://www.linkedin.com/in/wagnertim/",
    "bio": "Tim’s passions are building the next economy and giving back to society alongside diverse, action-oriented rebels. He thrives in ambiguous, rapidly evolving areas and seeks out opportunities at the intersection of things, where today's biggest advances are happening. Speaker at SXSW, TechCrunch Disrupt, Human + Tech Summit, VRX, Alibaba Summit, Startup Grind, CODE_n, Pioneer Summit, SF Design Week, UC Berkeley Haas Business School, Women in Tech Festival, Startup Health, SPUR, and more. Tim is an Angel Investor. Cross-Functional: He’s led and worked on product, marketing and business teams. Tim understands the needs of each and how to coordinate them to create tangible value. Cross-Border & Cross-Domain: Tim spent 5+ years working in Asia and 10+ years leading global growth. He’s also been lucky enough to circumnavigate the world by boat and travel to 65+ countries. His work experience spans enterprise, startup, academic, media, non-profit, and governmental organizations. Among his specialties are startup ecosystems, go-to-market partnerships, open innovation, human-centered design, systems thinking, emergent technology, and global strategy.",
    "capital_raised": "10,000,000",
    "exits": "6",
    "value_of_exits": "",
    "expertise": "AI, Marketing, Product, Design, Strategy",
    "company": "Independent Consultant"
  },
  {
    "name": "Taz Patel",
    "linkedin": "https://www.linkedin.com/in/tazpatel/",
    "bio": "Taz is an active investor and advisor to early stage startups. He is the Cofounder and was the Chief Revenue Officer of Captiv8. Previously, Taz was also the CRO of Republic Project, a startup acquired by Sizmek where he later helped scale their platform partnerships globally. Before that, Taz led monetization efforts at Showyou App, a socially curated mobile video experience for consumers eventually being acquired by Vevo. His passion for the startup ecosystem and knowledge across digital media stem from sales leadership roles at Interclick and BlueLithium, both of which were acquired by Yahoo!. He is currently the Head of Advertising and Shopping at Perplexity. At Perplexity, Taz is responsible for bringing marketers, retailers, and technologists together to build the future of advertising integrations and shopping experiences in the age of AI. Accredited as an Angel Investor an manager of Syndicat Funds (SPVs).",
    "capital_raised": "20,000,000",
    "exits": "4",
    "value_of_exits": "",
    "expertise": "AI, Sales, IP, Mobile, AR",
    "company": "Independent Consultant"
  },
  {
    "name": "Mark Charkin",
    "linkedin": "https://www.linkedin.com/in/markcharkin/",
    "bio": "I help ambitious tech start-ups scale from go-to-market scrappy to commercially unstoppable. Over the past 20+ years, I’ve built and led global revenue engines that have driven over $10B in exit value. From growing Bebo’s revenue from $2M to $45M (leading to its $850M sale), to scaling King’s ad business 10x in under two years ($5.9bn sale) I’ve been trusted to lead GTM across startups, scaleups, and household names. My sweet spot is the $0 - $100m. I’ve held CRO and commercial leadership roles across the US, and EMEA, and now advise founders and boards on how to build high-performing commercial functions that last—while avoiding the costly mistakes that can stall growth. I work with founders as an advisor, coach or operator (Series A-C) to help build the commercial side of the business with a focus on business operations, customer success, BD/partnerships, international expansion, talent acquisition & monetization/sales. I've been a part of building 6 start-ups that were acquired in aggregate for over $7.5billion of value to shareholders. Bebo, King Digital/Candy Crush, Brightroll, ExchangeLab, Deep Forest Media & Jaunt VR. As an operator I've built teams that have driven hundreds of millions of dollars of revenue, and hired hundreds of people at hyper growth companies such as Bebo, King Digital (aka Candy Crush), and MSN as an operator and companies such as Jaunt VR, Snap, Onfido, Brightroll, and Endemol as a senior advisor / consultant. I am something of an international expansion expert, launching King Digital into the US, Brightroll into the UK, Snap into EMEA and ExchangleLab into the US. Currently, I’m the Executive Director at GBx, supporting the next wave of ambitious UK founders scaling into the US. I also work with mission-driven tech companies as a fractional CRO and board advisor.",
    "capital_raised": "Bebo (social media) - first revenue hire and scaled the team to $45m revenue and",
    "exits": "",
    "value_of_exits": "",
    "expertise": "Sales, IP, Operations, AR, VR",
    "company": "GBx"
  },
  {
    "name": "Steve Adelman",
    "linkedin": "https://www.linkedin.com/in/nexuspartners/",
    "bio": "Highly experienced in business development, market entry/go to market, corporate venturing, partnerships, corporate strategy and general management. Repeatedly successful in early-stage and large companies. Focused on high tech and financial services. Nexus Partners is a Silicon Valley-based consultancy that works with tech companies to solve their hardest problems in order to accelerate their growth. They are passionate about crafting customer-centric strategies and applying them to their clients' growth and innovation objectives. They provide senior level expertise and focus for developing and executing marketing strategies: customer discovery, market entry, and key partnerships. Ran corporate venture group at Reuters (portfolio included Yahoo!, Verisign, Intertrust, and others) and Novell (including representing company on Kleiner, Perkins JAVA Fund); helped launch Palm Ventures. Founding member of Wharton Angels; individual angel investor for over two decades.",
    "capital_raised": "200,000,000",
    "exits": "1 (GTS acquired by Cisco); 1 as angel investor (IMlogic acquired by Symantec)",
    "value_of_exits": "",
    "expertise": "Marketing, Strategy, IP, AR",
    "company": "Independent Consultant"
  },
  {
    "name": "Marvin Liao",
    "linkedin": "https://www.linkedin.com/in/marvinliao/",
    "bio": "An Angel Investor, executive coach and ex-Operator. Marvin is a Partner at Diaspora VC & Board Member/Partner at GameGroove Capital. He was formerly a Partner at Venture Capital Fund 500 Startups, running the SF based accelerator program as well as investing in Seed stage startups. He Invests in Digital Media, Enterprise SAAS, Marketplace, Mobile, AdTech/MarketingTech, Digital Health, Internet of Things & Fintech startups. He invested in & worked with over 414 Pre-seed & Seed stage startups such as Embroker, Eaze, Aircall, Manychat, Shippo, RapidAPI, Worthix, Indio, Pipefy, Innovacer, Vela, Apostrophe, AgFunder, Printify, Whereto, Qualio, PlateIQ, Avanoo, Zentist, Stackshare, Shortpoint, MonkeyLearn & Cube.js (aka Statsbot) among many others during his tenure there. Previously an experienced client-facing senior executive in the media and technology space in both large and start up growth companies, having managed large multifunctional teams across multiple countries. He has P&L management experience and most recently was responsible for 100% YoY revenue growth while running a business unit and building new sales channels in EMEA & the Emerging Markets regions for the last ~4 years at Yahoo!. A 10.5 year veteran of Yahoo! Inc., Marvin has held executive roles in the various departments of Sales, Business Development, Ad Operations and Marketing. Most of his roles were regional or global management roles giving him extensive experience across Asia, Europe, Latin America and the United States in his career at the company. Marvin presently serves on the Investment Committee/Advisory boards of several Venture Capital Funds across the globe. Marvin is a frequent speaker at many Digital Marketing & Tech Startup Conferences.",
    "capital_raised": "None as Startup. Raised ~$10,000,000 from LPs for Fund 3 & 4 at 500 Startups",
    "exits": "",
    "value_of_exits": "",
    "expertise": "AI, SaaS, Marketing, Sales, IP",
    "company": "GameGroove Capital"
  },
  {
    "name": "Mike Dovbish",
    "linkedin": "https://www.linkedin.com/in/michaeldovbish/",
    "bio": "Mike is the Executive Director and one of the founding members of Nutrition Capital Network, an investor and partnering platform for growth companies in health and wellness. (Acquired by New Hope Network, part of Informa PLC in December, 2016). He specializes in strategy, capital raising, partnerships and business development for high-growth, sustainable health and wellness businesses and disruptive, consumer and ag tech companies. Mike is an advisor to an early-stage investment fund in the healthy living sector. He helps startups with market and value proposition assessments for international consumer companies entering the US market.",
    "capital_raised": "Assisted with capital raises, in total, between $30-50 million. (Companies include:",
    "exits": "1",
    "value_of_exits": "",
    "expertise": "AI, Strategy, IP, AR",
    "company": "Independent Consultant"
  },
  {
    "name": "Nikhil Dhongade",
    "linkedin": "https://www.linkedin.com/in/nikhil-dhongade/",
    "bio": "A dynamic commercial leader with proven record building highperformance go-to-market (GTM) engines across product management, growth marketing, sales, and business development in both deep tech startups (2x) and large public companies (2x). Deep Tech Startups: As Chief Business Officer at an early-stage AI/ML SaaS company, I drove the go-to-market strategy, marketing, business development, and commercialization of predictive and generative AI products to just under <$1M in a year. Previously, as Chief Operating Officer & CRO of a robotics company, I built the GTM engine and teams across product, sales, business development, and growth marketing to scale revenue to over $30M (includes Govt. DoD $s). Tech Public Companies: Held senior Product Marketing roles at public corporations (Getinge, 3M Acelity), where I led a $550M global product franchise and achieved over 10%+ you topline & EBITDA growth by launching more than 12 products.",
    "capital_raised": "25,000,000",
    "exits": "2",
    "value_of_exits": "< $1,000,000, $6B Public Company (Sold to PE)",
    "expertise": "AI, SaaS, Marketing, Sales, Product",
    "company": "Independent Consultant"
  },
  {
    "name": "Raffaella Camera",
    "linkedin": "https://www.linkedin.com/in/raffaellacamera/",
    "bio": "Senior executive with wide success in strategically building, growing and promoting businesses at the intersection of immersive tech, gaming, lifestyle/fashion, and entertainment. As Head of Brands for Epic Games’ Unreal Engine, Raffaella built and directed a multi-functional global team and was responsible for the strategic growth of the Epic ecosystem – from tools to Fortnite – for the Lifestyle Brands industry, including Fashion, Luxury, Beauty, Retail integrating into Music, Sports & Entertainment. Previously, Raffaella was a Partner/Managing Director at Accenture where she co-created and grew the global XR (AR/VR/3D) practice as Global Head of Innovation & Strategy. Prior to that she held leadership positions at prominent advertising agencies, including 72andSunny and Publicis Sapient. Raffaella has a strong entrepreneurial spirit and excels at: • • • • • •",
    "capital_raised": "",
    "exits": "",
    "value_of_exits": "",
    "expertise": "AI, Strategy, IP, XR, AR",
    "company": "Independent Consultant"
  },
  {
    "name": "Ronald Weissman",
    "linkedin": "https://www.linkedin.com/in/ronald-weissman-36a3841/",
    "bio": "Chair, Board of Directors, Angel Capital Association and former chair of the ACA's, Education and Smart Practices Committee. Author of the ACA's courses on Assessing and Managing Risks in Early Stage Investing and Angel Backed Boards of Directors. Former Vice Chair of the Board and Chair, Education and Smart Practices Committee. Chairman, Software Industry Group, Band of Angels, Silicon Valley's oldest technology investment group. 20+ years in global venture capital and sixteen years in angel investing. I have recently advised investors, governments, corporate VCs and startups in locations as diverse as Armenia, Germany, Israel, the Republic of Georgia, Italy, Chile, Australia, New Zealand and across the US. Senior Advisor, Neva, SGR. Neva is the venture capital arm of Italy's largest and Europe's fifth largest bank, Intesa Sanpaolo. I advise the Bank's Investment Committee on proposed investments and the fund on strategy, operations and portfolio management. I lecture on venture capital at major universities including Stanford, Santa Clara University, the American University of Armenia and the Deggendorf Institute of Technology, where I am an Adjunct Professor. Prior to work in private capital, I was CMO at Verity, the leader in corporate knowledge management, when the company was named Turnaround of of the Year by the Turnaround Management Association for becoming market share leader (1999.). Prior to Verity, I was Director of Strategic Marketing and DIrector of European Marketing at NeXT, reporting to Steve Jobs.",
    "capital_raised": "20,000,000",
    "exits": "One secondary offering as entrepreneur; 12+ as a VC/Angel",
    "value_of_exits": "Multi-billion $ total (as lead, co-lead or member of the investment team)",
    "expertise": "AI, Marketing, Strategy, Operations, Software",
    "company": "Independent Consultant"
  },
  {
    "name": "Ron Drabkin",
    "linkedin": "https://www.linkedin.com/in/ron-drabkin-9b14/",
    "bio": "Ron is a former VP, Online Marketing and Business Development at Justanswers.com. He is also a consultant and works with companies of Venture Capital firms with hands-on help on sales, BD, partnerships, online ads, and website conversion. As an entrepreneur, Ron had some successful exits, and even helped start an innovative school. Most recently at OpenEd, which was sold to ACT. He has taken companies to $125m (JustAnswer) and founded and sold a startup (JRG.) Ron has over 15 years Google and Facebook advertising experience with >$100m spent.",
    "capital_raised": "15,000,000",
    "exits": "3",
    "value_of_exits": "",
    "expertise": "Marketing, Sales, IP, AR",
    "company": "Independent Consultant"
  },
  {
    "name": "Rich Fox",
    "linkedin": "https://www.linkedin.com/in/richfox/",
    "bio": "I’m a veteran technology executive, startup founder, and investor with over two decades of experience scaling software companies and building real estate portfolios. I’ve held leadership roles at high-growth ventures including InterVu (acquired by Akamai), ExtraHop (acquired by Bain Capital). I founded UpTyck, a Gmail-based CRM platform for small businesses. I went on to join Amplion (acquired by Science & Medicine Group), and Kollective Technology, where I led enterprise growth and customer success operations across the U.S. and U.K., based in London supporting clients such as LinkedIn, Salesforce, Nokia, and AstraZeneca. At Vimeo, I led the Strategic Accounts team for the Enterprise platform, driving a 61% year-over-year growth in 2023, working with strategic customers such as PepsiCo, Kohl’s, Walmart, & Expedia.",
    "capital_raised": "2,150,000",
    "exits": "",
    "value_of_exits": "",
    "expertise": "AI, Sales, IP, Operations, Software",
    "company": "Independent Consultant"
  },
  {
    "name": "Steve Goldberg",
    "linkedin": "https://www.linkedin.com/in/stevenhgoldberg/",
    "bio": "Steve is currently a Partner at DYDX Capital. Previously, Steve was a Partner at Finistere Ventures (2021-2025) and Venrock from (2009 – 2020) after having been CEO of several early-stage companies including DataRunway, Vidient, Arcwave, and CoWave Networks. Prior to that, he was Vice President of Research and Development at Nokia Internet Communications and Vice President and General Manager of the Wireless Communications Division at Cylink Corporation. Steve also held senior management and engineering positions at Trimble Navigation and Hewlett Packard. At Venrock, Steve focused on investments in connectivity, M2M/Internet of Things, security, robotics, and embedded systems. He is currently sitting on the Board of Directors of Finistere investments CropX and Sidework. He also sits on the board of SolidPower (SLDP:Nasdaq), an EV lithium-ion, solid-state battery company. He is also a company advisor to Alcatraz.ai and Bruviti. Previous board seats include Lucid Motors (Nasdaq: LCID), Quantenna (Nasdaq:QTNA), Canesta (Acq by Microsoft), Kineto Wireless (Acq by Taqua), Newport Media (Acq by Atmel), and Teranetics (Acq by PLX Technology). He also continues to be involved with early-stage company advising and also provides Expert Witness support for IP/Patent litigation. He holds a Ph.D. E.E. degree from the University of California at Santa Barbara and M.S.E.E. and B.S.E.E degrees from Washington University in St Louis, Mo. He is a Life Member of the IEEE and a past president of the IEEE Communications Society, Santa Clara Section.",
    "capital_raised": "",
    "exits": "",
    "value_of_exits": "",
    "expertise": "AI, Engineering, IP, AR",
    "company": "DYDX Capital"
  },
  {
    "name": "Swapnil Amin",
    "linkedin": "https://www.linkedin.com/in/swapnil-amin-201b5121b/",
    "bio": "Former Tesla Director now advising OEMs, Tier 1s, chipmakers, and investors on SDV execution, OTA economics, ADAS validation, robotics (humanoids & industrial), EV batteries, BESS, semiconductors, and energy systems. 20+ years across Tesla, Amazon, Genentech, SoftBank Robotics, Accenture (Consulting), Yahoo, and HPE scaling autonomy, robotics, AI platforms, and digital health. The most valuable tech isn’t the flashiest demo — it’s the one that works in messy, real-world workflows. Highlights: – – – –",
    "capital_raised": "",
    "exits": "",
    "value_of_exits": "",
    "expertise": "AI, IP, AR",
    "company": "Independent Consultant"
  },
  {
    "name": "Ayman Fawaz",
    "linkedin": "https://www.linkedin.com/in/ayman-fawaz-270970/",
    "bio": "Ayman is the Director of Venture Technology at Siemens. He is also the Founder, President at orgo.ai. Additionally, Dr. Fawaz is a successful serial entrepreneur who has served as a seed investor and coach for numerous early stage start-ups, and is co-inventor on nine patents. He was a member of the 2016 Committee of Visitors for the NSF Division of Industrial Innovation and Partnerships. Ayman has offered a workshop at UC Berkeley on how to write a winning proposal for the NSF SBIR program.",
    "capital_raised": "10,000,000",
    "exits": "2",
    "value_of_exits": "",
    "expertise": "AI, IP, AR",
    "company": "Venture Technology at Siemens"
  },
  {
    "name": "Raul Quino",
    "linkedin": "https://www.linkedin.com/in/raulquino/",
    "bio": "Strategy & Business Development professional with proven track record in business development, strategic partner acquisition, technology evaluation and product management. Expertise in product innovation, software business models, opportunity identification, and go-to-market strategies. Strong business acumen supported by a University of Chicago Booth School of Business MBA, combined with technical skills honed by experience throughout product life-cycle, as well as demonstrated analytical, decision making, negotiation and problem solving skills. Skilled at building strong relationships and leading multiple cross-functional teams, with a broad global exposure with partners and customers in the wireless industry in the US, Latin America, Europe and Asia.",
    "capital_raised": "",
    "exits": "",
    "value_of_exits": "",
    "expertise": "Product, Strategy, IP, Software, AR",
    "company": "Independent Consultant"
  },
  {
    "name": "Howard Steinberg",
    "linkedin": "https://www.linkedin.com/in/hsteinberg/",
    "bio": "I have over 25 years of experience in business development and sales, working with SaaS, Ecommerce, Food & Beverage and digital media companies, domestically and internationally. I leverage analytical background with my expertise in social networking, digital marketing and product marketing to help technology and digital media clients achieve their growth and revenue goals. Current and recent clients: Acceler8 Labs, DistroScale, Ichido Sake, Bridgehead Media, DataCall.ai, and MomentScience. I provide dedicated and focused efforts in direct and channel sales, account management, strategic alliances and partner management. I use data-driven methods, market analyses, and my network (and resourcefulness) to deliver successful business outcomes. I also work cross-functionally across client and strategic partner organizations, ranging from early-stage startups - US-based and overseas - to enterprise-level companies. Additionally, I serve as a board member for a number of organizations: Lionel Wilson Preparatory High School, Strong Women in IT and viaGoood (a Czech Republic-based startup platform focused on philanthropy and giving ... and a former client.)",
    "capital_raised": "",
    "exits": "",
    "value_of_exits": "",
    "expertise": "AI, SaaS, Marketing, Sales, Product",
    "company": "Independent Consultant"
  },
  {
    "name": "Mark Friedler",
    "linkedin": "https://www.linkedin.com/in/markfriedler/",
    "bio": "As the CEO of Gigex, Inc., I lead a team of C-suite execs who help companies execute digital transformations with a concierge model. We help leaders reduce stress, save time, money by evaluating and selecting the best IT solutions for their business growth and operations. With over 20 years of experience in strategic sales and business development, I have a proven track record of delivering exceptional results for our clients, partners, and stakeholders. As a senior enterprise technology consultant, I leverage my expertise in SaaS, cloud, blockchain, media, games, and on-demand apps to solve business and technology challenges for companies across various industries. Additionally, I'm a senior adviser and blockchain/crypto SME at Dundon Advisers LLC, where I help creditors recover losses in crypto bankruptcies. I'm passionate about innovation, collaboration, and customer satisfaction, and I'm always looking for new opportunities to create value and impact in the digital space.",
    "capital_raised": "25,000,000",
    "exits": "3",
    "value_of_exits": "",
    "expertise": "AI, SaaS, Blockchain, Sales, Operations",
    "company": "Gigex"
  },
  {
    "name": "Tomasz Kolodziejak",
    "linkedin": "https://www.linkedin.com/in/tomaszkol/",
    "bio": "Tomasz Kolodziejak is a corporate innovator and seasoned entrepreneur with a proven track record of building transformative technology products and scaling startups globally. He currently leads open innovation and strategic initiatives at Samsung Electronics, focusing on new products, partnerships, and seed corporate venture investments. His work bridges the gap between cutting-edge technology and practical market applications, helping shape the future of consumer and enterprise tech. Before joining Samsung, Tomasz founded startups that were part of Stanford StartX and Berkeley SkyDeck, raising funding from Stanford and Johnson & Johnson and partnering with leading airlines, including KLM, ANA, and Lufthansa. He has deep experience in fundraising, product-market fit, and enterprise growth across international markets, making him a trusted advisor for early-stage companies and founders. Tomasz is also the Founder & Managing Partner of 415 Ventures, a boutique venture studio supporting global founders and VCs, and an angel investor with Hustle Fund, helping pre-seed startups raise capital and scale in the U.S. market. He mentors emerging founders through Techstars and Plug and Play Tech Center, sharing his expertise in go-to-market strategy, growth, and strategic storytelling. Tomasz combines an entrepreneurial mindset with corporate strategy experience, enabling him to turn ambitious ideas into globally relevant ventures.",
    "capital_raised": "VC – $4,000,000; Crowdfunding $0.5M",
    "exits": "1",
    "value_of_exits": "",
    "expertise": "AI, Product, Strategy, Fundraising, IP",
    "company": "Independent Consultant"
  },
  {
    "name": "Bob Upham",
    "linkedin": "https://www.linkedin.com/in/bobupham/",
    "bio": "Bob Upham is a seasoned business development and innovation executive with extensive experience scaling startups, launching global products, and building strategic partnerships across North America, Europe, and Asia. He has launched Visa’s digital payment products—including Apple Pay, Samsung Pay, and Google Pay—in international markets, and has led strategic partnerships at Yahoo!, working with Twitter, Apple, Amazon, Microsoft, AT&T, Yelp, Foursquare, and others. His expertise spans corporate development, digital platforms, and crossborder business strategy. Bob is a proven entrepreneur and startup leader. He founded two companies, one of which was named to Inc. Magazine’s 500 Fastest-Growing Companies in the U.S., and has led U.S. operations for a Chinese-based Series B startup. He also headed business development and corporate strategy for a Series A startup and advises companies on scaling, fundraising, and entering new markets. In addition to his executive experience, Bob is an active mentor and advisor to incubators and accelerators worldwide, including Cyberport (Hong Kong), TrepCamp (Mexico City), and Santander Innoventures (Madrid). He currently serves as a strategic advisor and mentor, helping founders, investors, and global teams navigate go-to-market strategies, corporate partnerships, and international expansion.",
    "capital_raised": "46,000,000",
    "exits": "",
    "value_of_exits": "",
    "expertise": "AI, Product, Strategy, Fundraising, IP",
    "company": "Independent Consultant"
  },
  {
    "name": "Shamala Hinrichsen",
    "linkedin": "https://www.linkedin.com/in/shamalahinrichsen/",
    "bio": "Shamala Hinrichsen is a seasoned healthtech founder and global health strategist with over 20 years of experience across four continents. As the CEO and Founder of Hanai Inc and co-creator of SheHer.app, she is pioneering accessible digital health solutions for women worldwide. With a background in population genetics, Shamala brings a rare blend of scientific expertise, cross-cultural insight, and entrepreneurial drive. Her work bridges the gap between underserved communities and the tech-enabled future of healthcare, informed by a career that spans biotech, pharma, government advisory, and digital innovation. Other relevant achievements/acknowledgements: •",
    "capital_raised": "500,000",
    "exits": "",
    "value_of_exits": "",
    "expertise": "AI, IoT, Healthcare, AR",
    "company": "Independent Consultant"
  }
]